HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMtu_regdef.h
/** \\brief  Memory MBISTEnable Register 2 */
typedef struct _Ifx_MTU_MEMTEST2_Bits
{
    unsigned int EMEMU2EN:1;                /**< \brief [0:0] EMEM Upper 2 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU3EN:1;                /**< \brief [1:1] EMEM Upper 3 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU4EN:1;                /**< \brief [2:2] EMEM Upper 4 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU5EN:1;                /**< \brief [3:3] EMEM Upper 5 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU6EN:1;                /**< \brief [4:4] EMEM Upper 6 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU7EN:1;                /**< \brief [5:5] EMEM Upper 7 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU8EN:1;                /**< \brief [6:6] EMEM Upper 8 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU9EN:1;                /**< \brief [7:7] EMEM Upper 9 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU10EN:1;               /**< \brief [8:8] EMEM Upper 10 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU11EN:1;               /**< \brief [9:9] EMEM Upper 11 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU12EN:1;               /**< \brief [10:10] EMEM Upper 12 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU13EN:1;               /**< \brief [11:11] EMEM Upper 13 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU14EN:1;               /**< \brief [12:12] EMEM Upper 14 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int EMEMU15EN:1;               /**< \brief [13:13] EMEM Upper 15 (XCM) Controller Memory Test Enable (rwh) */
    unsigned int CIF0EN:1;                  /**< \brief [14:14] CIF JPEG1_4 Memory Enable (ED only) (rwh) */
    unsigned int DAMEN:1;                   /**< \brief [15:15] DAM Memory Enable (rwh) */
    unsigned int CIF1EN:1;                  /**< \brief [16:16] CIF JPEG3 Memory Enable (ADAS Product only) (rwh) */
    unsigned int CIF2EN:1;                  /**< \brief [17:17] CIF Memory2 Enable (ADAS Product only) (rwh) */
    unsigned int STBY2EN:1;                 /**< \brief [18:18] Reserved in this product (r) */
    unsigned int DMAEN:1;                   /**< \brief [19:19] DMA MBIST Controller Memory Enable (rwh) */
    unsigned int XTM0EN:1;                  /**< \brief [20:20] EMEM XTM0 Controller Memory Enable (ED only) (rwh) */
    unsigned int XTM1EN:1;                  /**< \brief [21:21] EMEM XTM1 Controller Memory Enable (ED only) (rwh) */
    unsigned int FFT0EN:1;                  /**< \brief [22:22] FFT0 Memory Controller Memory Enable (ADAS Product only) (rwh) */
    unsigned int FFT1EN:1;                  /**< \brief [23:23] FFT1 Memory Controller Memory Enable (ADAS Product only) (rwh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_MTU_MEMTEST2_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mtu_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_ACCEN0_Bits B;
} Ifx_MTU_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_ACCEN1_Bits B;
} Ifx_MTU_ACCEN1;

/** \\brief  Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_CLC_Bits B;
} Ifx_MTU_CLC;

/** \\brief  Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_ID_Bits B;
} Ifx_MTU_ID;

/** \\brief  Memory Mapping Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_MEMMAP_Bits B;
} Ifx_MTU_MEMMAP;

/** \\brief  Memory Status Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_MEMSTAT0_Bits B;
} Ifx_MTU_MEMSTAT0;

/** \\brief  Memory Status Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_MEMSTAT1_Bits B;
} Ifx_MTU_MEMSTAT1;

/** \\brief  Memory Status Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_MEMSTAT2_Bits B;
} Ifx_MTU_MEMSTAT2;

/** \\brief  Memory MBISTEnable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_MEMTEST0_Bits B;
} Ifx_MTU_MEMTEST0;

/** \\brief  Memory MBISTEnable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_MEMTEST1_Bits B;
} Ifx_MTU_MEMTEST1;

/** \\brief  Memory MBISTEnable Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_MEMTEST2_Bits B;
} Ifx_MTU_MEMTEST2;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mtu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

